tap "gcenx/wine"
tap "hashicorp/tap"
tap "kegworks-app/kegworks"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python code formatter
brew "black"
# Cloud Development Kit for Terraform
brew "cdktf"
# Fix common misspellings in source code and text files
brew "codespell"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Speed up eslint to accelerate your development workflow
brew "eslint_d", link: false
# Lint your Python code for style and logical errors
brew "flake8"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go formatter that additionally inserts import statements
brew "goimports"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Package manager for the Lua programming language
brew "luarocks"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli", link: false
# Fast, highly customisable system info script
brew "neofetch"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Prettier daemon
brew "prettierd"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Safe, concurrent, practical language
brew "rust"
# Autoformat shell script source code
brew "shfmt"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Linter for YAML files
brew "yamllint"
# Terraform
brew "hashicorp/tap/terraform"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Porting tool, to make Windows programs/games into native apps
cask "kegworks"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Compatibility layer to run Windows applications
cask "wine-stable"
